zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
#include "cy_device.h"

#if defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS) || defined (CY_IP_MXS40FLASHC)

#include "cy_ipc_drv.h"
#include "cy_syslib.h"
#if defined(CY_IP_MXFLASHC_VERSION_ECT)
#include "cy_flash_srom.h"
#endif

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
* Macro definitions
***************************************/
/**
* \addtogroup group_flash_macros
* \{
*/

/** Driver major version */
#define CY_FLASH_DRV_VERSION_MAJOR       3

/** Driver minor version */
#define CY_FLASH_DRV_VERSION_MINOR       150

#define CY_FLASH_ID               (CY_PDL_DRV_ID(0x14UL))                          /**< FLASH PDL ID */

#define CY_FLASH_ID_INFO          (uint32_t)( CY_FLASH_ID | CY_PDL_STATUS_INFO )   /**< Return prefix for FLASH driver function status codes */
#define CY_FLASH_ID_WARNING       (uint32_t)( CY_FLASH_ID | CY_PDL_STATUS_WARNING) /**< Return prefix for FLASH driver function warning return values */
#define CY_FLASH_ID_ERROR         (uint32_t)( CY_FLASH_ID | CY_PDL_STATUS_ERROR)   /**< Return prefix for FLASH driver function error return values */

/** \} group_flash_macros */


/**
* \addtogroup group_flash_general_macros
* \{
*/

#if !defined (CY_IP_MXS40FLASHC)
/** Flash row size */
#if defined (CPUSS_FLASHCX_PA_SIZE)
    #define CY_FLASH_SIZEOF_ROW                (CPUSS_FLASHCX_PA_SIZE * 4U)
#else
    #define CY_FLASH_SIZEOF_ROW                (CPUSS_FLASHC_PA_SIZE * 4U)
#endif /* CPUSS_FLASHCX_PA_SIZE */
/** Long words flash row size */
#define CY_FLASH_SIZEOF_ROW_LONG_UNITS     (CY_FLASH_SIZEOF_ROW / sizeof(uint32_t))

#else
/** Flash row size is 512 bytes. When refresh feature is enabled then extra 16 bytes are used to store column 33 related information.*/
#define CY_FLASH_SIZEOF_ROW                512U
/** Main NVM region start address */
#define CY_FLASH_MAIN_START_ADDRESS        CPUSS_FLASHC_MAIN_START_ADDRESS
/** Main NVM region end address */
#define CY_FLASH_MAIN_END_ADDRESS          CY_FLASH_MAIN_START_ADDRESS + (0x400UL * 8UL * CPUSS_RRAMC_MAIN_N) /* Main NVM region size in multiples of 8KB */


#endif /* !defined (CY_IP_MXS40FLASHC) */

/** \} group_flash_general_macros */

#if defined(CY_IP_MXFLASHC_VERSION_ECT)

/** \cond INTERNAL */

/** Flash bounds */
typedef enum
{
    CY_FLASH_IN_BOUNDS,
    CY_FLASH_OUT_OF_BOUNDS,
} en_flash_bounds_t;

#define CY_FLASH_NUMBER_ROWS (CPUSS_FLASH_SIZE/CY_FLASH_SIZEOF_ROW) /** Number of flash rows */

#define CY_WFLASH_LG_SBM_TOP  CY_WFLASH_LG_SBM_BASE
#define CY_WFLASH_LG_SBM_END  (CY_WFLASH_LG_SBM_BASE + CY_WFLASH_LG_SBM_SIZE)

#define CY_WFLASH_SM_SBM_TOP  CY_WFLASH_SM_SBM_BASE
#define CY_WFLASH_SM_SBM_END  (CY_WFLASH_SM_SBM_BASE + CY_WFLASH_SM_SBM_SIZE)

#define CY_WFLASH_LG_DBM0_TOP CY_WFLASH_LG_DBM0_BASE
#define CY_WFLASH_LG_DBM0_END (CY_WFLASH_LG_DBM0_BASE + CY_WFLASH_LG_DBM0_SIZE)

#define CY_WFLASH_SM_DBM0_TOP CY_WFLASH_SM_DBM0_BASE
#define CY_WFLASH_SM_DBM0_END (CY_WFLASH_SM_DBM0_BASE + CY_WFLASH_SM_DBM0_SIZE)

#define CY_WFLASH_LG_DBM1_TOP CY_WFLASH_LG_DBM1_BASE
#define CY_WFLASH_LG_DBM1_END (CY_WFLASH_LG_DBM1_BASE + CY_WFLASH_LG_DBM1_SIZE)

#define CY_WFLASH_SM_DBM1_TOP CY_WFLASH_SM_DBM1_BASE
#define CY_WFLASH_SM_DBM1_END (CY_WFLASH_SM_DBM1_BASE + CY_WFLASH_SM_DBM1_SIZE)

#define CY_FLASH_LG_SBM_TOP  CY_FLASH_LG_SBM_BASE
#define CY_FLASH_LG_SBM_END  (CY_FLASH_LG_SBM_BASE + CY_FLASH_LG_SBM_SIZE)

#define CY_FLASH_SM_SBM_TOP  CY_FLASH_SM_SBM_BASE
#define CY_FLASH_SM_SBM_END  (CY_FLASH_SM_SBM_BASE + CY_FLASH_SM_SBM_SIZE)

#define CY_FLASH_LG_DBM0_TOP CY_FLASH_LG_DBM0_BASE
#define CY_FLASH_LG_DBM0_END (CY_FLASH_LG_DBM0_BASE + CY_FLASH_LG_DBM0_SIZE)

#define CY_FLASH_SM_DBM0_TOP CY_FLASH_SM_DBM0_BASE
#define CY_FLASH_SM_DBM0_END (CY_FLASH_SM_DBM0_BASE + CY_FLASH_SM_DBM0_SIZE)

#define CY_FLASH_LG_DBM1_TOP CY_FLASH_LG_DBM1_BASE
#define CY_FLASH_LG_DBM1_END (CY_FLASH_LG_DBM1_BASE + CY_FLASH_LG_DBM1_SIZE)

#define CY_FLASH_SM_DBM1_TOP CY_FLASH_SM_DBM1_BASE
#define CY_FLASH_SM_DBM1_END (CY_FLASH_SM_DBM1_BASE + CY_FLASH_SM_DBM1_SIZE)

#define CY_SFLASH_TOP  CY_SFLASH_BASE
#define CY_SFLASH_END  (CY_SFLASH_BASE + CY_SFLASH_SIZE)

#define CY_SFLASH1_TOP CY_SFLASH1_BASE
#define CY_SFLASH1_END (CY_SFLASH1_BASE + CY_SFLASH1_SIZE)

#if defined(FLASHC1)
#define CY_WFLASH1_LG_SBM_TOP  CY_WFLASH1_LG_SBM_BASE
#define CY_WFLASH1_LG_SBM_END  (CY_WFLASH1_LG_SBM_BASE + CY_WFLASH1_LG_SBM_SIZE)

#define CY_WFLASH1_SM_SBM_TOP  CY_WFLASH1_SM_SBM_BASE
#define CY_WFLASH1_SM_SBM_END  (CY_WFLASH1_SM_SBM_BASE + CY_WFLASH1_SM_SBM_SIZE)

#define CY_WFLASH1_LG_DBM0_TOP CY_WFLASH1_LG_DBM0_BASE
#define CY_WFLASH1_LG_DBM0_END (CY_WFLASH1_LG_DBM0_BASE + CY_WFLASH1_LG_DBM0_SIZE)

#define CY_WFLASH1_SM_DBM0_TOP CY_WFLASH1_SM_DBM0_BASE
#define CY_WFLASH1_SM_DBM0_END (CY_WFLASH1_SM_DBM0_BASE + CY_WFLASH1_SM_DBM0_SIZE)

#define CY_WFLASH1_LG_DBM1_TOP CY_WFLASH1_LG_DBM1_BASE
#define CY_WFLASH1_LG_DBM1_END (CY_WFLASH1_LG_DBM1_BASE + CY_WFLASH1_LG_DBM1_SIZE)

#define CY_WFLASH1_SM_DBM1_TOP CY_WFLASH1_SM_DBM1_BASE
#define CY_WFLASH1_SM_DBM1_END (CY_WFLASH1_SM_DBM1_BASE + CY_WFLASH1_SM_DBM1_SIZE)

#define CY_FLASH1_LG_SBM_TOP  CY_FLASH1_LG_SBM_BASE
#define CY_FLASH1_LG_SBM_END  (CY_FLASH1_LG_SBM_BASE + CY_FLASH1_LG_SBM_SIZE)

#define CY_FLASH1_SM_SBM_TOP  CY_FLASH1_SM_SBM_BASE
#define CY_FLASH1_SM_SBM_END  (CY_FLASH1_SM_SBM_BASE + CY_FLASH1_SM_SBM_SIZE)

#define CY_FLASH1_LG_DBM0_TOP CY_FLASH1_LG_DBM0_BASE
#define CY_FLASH1_LG_DBM0_END (CY_FLASH1_LG_DBM0_BASE + CY_FLASH1_LG_DBM0_SIZE)

#define CY_FLASH1_SM_DBM0_TOP CY_FLASH1_SM_DBM0_BASE
#define CY_FLASH1_SM_DBM0_END (CY_FLASH1_SM_DBM0_BASE + CY_FLASH1_SM_DBM0_SIZE)

#define CY_FLASH1_LG_DBM1_TOP CY_FLASH1_LG_DBM1_BASE
#define CY_FLASH1_LG_DBM1_END (CY_FLASH1_LG_DBM1_BASE + CY_FLASH1_LG_DBM1_SIZE)

#define CY_FLASH1_SM_DBM1_TOP CY_FLASH1_SM_DBM1_BASE
#define CY_FLASH1_SM_DBM1_END (CY_FLASH1_SM_DBM1_BASE + CY_FLASH1_SM_DBM1_SIZE)
#endif /* defined(FLASHC1) */

#define CY_WORK_LES_SIZE_IN_BYTE  (0x00000800UL)
#define CY_WORK_LES_SIZE_IN_WORD  (0x00000800UL / 4UL)
#define CY_WORK_SES_SIZE_IN_BYTE  (0x00000080UL)
#define CY_WORK_SES_SIZE_IN_WORD  (0x00000080UL / 4UL)

#define CY_CODE_LES_SIZE_IN_BYTE  (0x00008000UL)
#define CY_CODE_LES_SIZE_IN_WORD  (0x00008000UL / 4UL)
#define CY_CODE_SES_SIZE_IN_BYTE  (0x00002000UL)
#define CY_CODE_SES_SIZE_IN_WORD  (0x00002000UL / 4UL)


