zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
typedef enum
{
    CY_FLASH_MAIN_REGION = 0U,
    CY_FLASH_WORK_REGION,
    CY_FLASH_CA_CM0P_REGION
} cy_en_region_t;

/** \endcond */
#endif // (defined(CY_IP_MXFLASHC_VERSION_ECT))



/**
* \addtogroup group_flash_enumerated_types
* \{
*/

/** This enum has the return values of the Flash driver */
typedef enum cy_en_flashdrv_status
{
    CY_FLASH_DRV_SUCCESS                  =   0x00UL,  /**< Success */
    CY_FLASH_DRV_INV_PROT                 =   ( CY_FLASH_ID_ERROR + 0x0UL),  /**< Invalid device protection state */
    CY_FLASH_DRV_INVALID_FM_PL            =   ( CY_FLASH_ID_ERROR + 0x1UL),  /**< Invalid flash page latch address */
    CY_FLASH_DRV_INVALID_FLASH_ADDR       =   ( CY_FLASH_ID_ERROR + 0x2UL),  /**< Invalid flash address */
    CY_FLASH_DRV_ROW_PROTECTED            =   ( CY_FLASH_ID_ERROR + 0x3UL),  /**< Row is write protected */
    CY_FLASH_DRV_IPC_BUSY                 =   ( CY_FLASH_ID_ERROR + 0x5UL),  /**< IPC structure is already locked by another process */
    CY_FLASH_DRV_INVALID_INPUT_PARAMETERS =   ( CY_FLASH_ID_ERROR + 0x6UL),  /**< Input parameters passed to Flash API are not valid */
    CY_FLASH_DRV_PL_ROW_COMP_FA           =   ( CY_FLASH_ID_ERROR + 0x22UL), /**< Comparison between Page Latches and FM row failed */
    CY_FLASH_DRV_ERR_UNC                  =   ( CY_FLASH_ID_ERROR + 0xFFUL), /**< Unknown error code. See \ref Cy_Flash_GetExternalStatus() */
    CY_FLASH_DRV_PROGRESS_NO_ERROR        =   ( CY_FLASH_ID_INFO  + 0x0UL),  /**< Command in progress; no error */
    CY_FLASH_DRV_OPERATION_STARTED        =   ( CY_FLASH_ID_INFO  + 0x1UL),  /**< Flash operation is successfully initiated */
    CY_FLASH_DRV_OPCODE_BUSY              =   ( CY_FLASH_ID_INFO  + 0x2UL),  /**< Flash is under operation */
    CY_FLASH_DRV_CHECKSUM_NON_ZERO        =   ( CY_FLASH_ID_ERROR + 0x4UL),  /**< Checksum of FLASH resulted in non-zero (SROM STATUS CODE: 0xF000000A) */
    CY_FLASH_DRV_NO_ERASE_SUSPEND         =   ( CY_FLASH_ID_ERROR + 0x7UL),  /**< Returned when EraseResume is called when no sector is suspended from erase (SROM STATUS CODE: 0xF0000092) */
    CY_FLASH_DRV_FLASH_NOT_ERASED         =   ( CY_FLASH_ID_ERROR + 0x8UL),  /**< Returned when ProgramRow is invoked on unerased cells or blank check fails (SROM STATUS CODE: 0xF00000A4) */
    CY_FLASH_DRV_NO_ERASE_ONGOING         =   ( CY_FLASH_ID_ERROR + 0x9UL),  /**< Returned by EraseSuspend when called with no ongoing erase operation (SROM STATUS CODE: 0xF00000A5) */
    CY_FLASH_DRV_ACTIVE_ERASE             =   ( CY_FLASH_ID_ERROR + 0xAUL),  /**< Returned by ProgramRow when active erase operation is going on (SROM STATUS CODE: 0xF00000A6) */
    CY_FLASH_DRV_INVALID_DATA_WIDTH       =   ( CY_FLASH_ID_ERROR + 0xBUL),  /**< Returned by ProgramRow API if invalid program width option is provided (SROM STATUS CODE: 0xF00000A8) */
    CY_FLASH_DRV_FLASH_SAFTEY_ENABLED     =   ( CY_FLASH_ID_ERROR + 0xCUL),  /**< Returned by FLASH program/erase APIs when writes are disabled in safety register (SROM STATUS CODE: 0xF00000AA) */
    CY_FLASH_DRV_INVALID_SFLASH_ADDR      =   ( CY_FLASH_ID_ERROR + 0xDUL),  /**< Returned when WriteRow is called on invalid SFLASH rows in NORMAL state (SROM STATUS CODE: 0xF00000B2) */
    CY_FLASH_DRV_SFLASH_BACKUP_ERASED     =   ( CY_FLASH_ID_ERROR + 0xEUL),  /**< Returned by Sflash programming APIs when backup sector is in erased state (SROM STATUS CODE: 0xF00000BB) */
    CY_FLASH_DRV_SECTOR_SUSPEND           =   ( CY_FLASH_ID_ERROR + 0xFUL),  /**< Returned when Program operation is called on sector which is suspended from erase (SROM STATUS CODE: 0xF0000091) */
    CY_FLASH_DRV_SROM_API_TIMEOUT         =   ( CY_FLASH_ID_ERROR + 0x10UL),  /**< Time out happens after calling srom API driver */
#if defined (CY_IP_MXS40FLASHC)
    CY_FLASH_DRV_REFRESH_NOT_SUPPORTED    =   ( CY_FLASH_ID_ERROR + 0x11UL),  /**< Refresh on this sector is not supported. */
    CY_FLASH_DRV_REFRESH_FAILED           =   ( CY_FLASH_ID_ERROR + 0x12UL),  /**< Refresh Operation failed. */
    CY_FLASH_DRV_REFRESH_NOT_ENABLED      =   ( CY_FLASH_ID_ERROR + 0x13UL),  /**< Refresh Feature not enabled. */
    CY_FLASH_DRV_INIT_FAILED              =   ( CY_FLASH_ID_ERROR + 0x14UL),  /**< Flash initialization failed. */
    CY_FLASH_DRV_REFRESH_NOTHING          =   ( CY_FLASH_ID_INFO  + 0x3UL),   /**< There are no any flash rows to recover. */
#endif /* defined (CY_IP_MXS40FLASHC) */
} cy_en_flashdrv_status_t;

#if defined (CY_IP_MXS40FLASHC) || defined(CY_DOXYGEN)
/** No of errors when ECC error injection is enabled.  */
typedef enum
{
    CY_FLASH_ECC_ERRORS_LESS_THAN_TWO = (0x00UL),   /**< Number of non-recoverable errors are less than two */
    CY_FLASH_ECC_ERRORS_MORE_THAN_ONE = (0x01UL)    /**< Number of non-recoverable errors are more than or equal to two */
} cy_en_flash_ecc_inject_errors_t;
#endif

#if ((defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION >=2)) || defined (CY_IP_M7CPUSS)) || defined(CY_DOXYGEN)
/** Flash Dual bank mode configuration */
typedef enum
{
    CY_FLASH_SINGLE_BANK_MODE = 0U, /**< Single Bank Mode */
    CY_FLASH_DUAL_BANK_MODE = 1U    /**< Dual Bank Mode   */
} cy_en_bankmode_t;

/** Flash Dual bank mode Mapping configuration */
typedef enum
{
    CY_FLASH_MAPPING_A = 0U,  /**< Mapping A */
    CY_FLASH_MAPPING_B = 1U   /**< Mapping B */
} cy_en_maptype_t;
#endif /* (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION >=2)) || defined (CY_IP_M7CPUSS) */

#if defined (CY_IP_MXS40FLASHC) || defined(CY_DOXYGEN)

/** Callback function type */
typedef void (*cy_flash_callback_t)(void);


/** Callback function configuration for non-blocking API's */
typedef struct
{
    cy_flash_callback_t callback_before_operation;    /**< A callback before operation is started */
    cy_flash_callback_t callback_operation_started;   /**< A callback after operation is started  */
    cy_flash_callback_t callback_operation_complete;  /**< A callback when operation is completed */

} cy_stc_flash_callback_t;

/** Flash Dual bank mode mapping configuration */
typedef enum
{
    CY_FLASH_MAPPING_MAIN_A_WORK_A     = (0x00UL), /**< MAIN (Mapping A), WORK (Mapping A). */
    CY_FLASH_MAPPING_MAIN_B_WORK_A     = (0x01UL), /**< MAIN (Mapping B), WORK (Mapping A). */
    CY_FLASH_MAPPING_MAIN_A_WORK_B     = (0x10UL), /**< MAIN (Mapping A), WORK (Mapping B). */
    CY_FLASH_MAPPING_MAIN_B_WORK_B     = (0x11UL)  /**< MAIN (Mapping B), WORK (Mapping B). */
} cy_en_flash_dual_bank_mapping_t;
#endif /* defined (CY_IP_MXS40FLASHC) */

#if !defined (CY_FLASH_RWW_DRV_SUPPORT_DISABLED) || defined(CY_DOXYGEN)
    /** Flash notification configuration structure */
    typedef struct
    {
        uint8_t  clientID;      /**< Client ID */
        uint8_t  pktType;       /**< Message Type */
        uint16_t intrRelMask;   /**< Mask */
    } cy_stc_flash_notify_t;
#endif /* !defined (CY_FLASH_RWW_DRV_SUPPORT_DISABLED) */

/** \} group_flash_enumerated_types */

#if (defined(CY_IP_MXFLASHC_VERSION_ECT)) || defined(CY_DOXYGEN)

/**
* \addtogroup group_flash_enumerated_types
* \{
*/
/** Flash Program row data size configuration */
typedef enum
{
    CY_FLASH_PROGRAMROW_DATA_SIZE_8BIT    = (0x00UL),   /**< Set program row data size 8 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_16BIT   = (0x01UL),   /**< Set program row data size 16 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_32BIT   = (0x02UL),   /**< Set program row data size 32 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_64BIT   = (0x03UL),   /**< Set program row data size 64 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_128BIT  = (0x04UL),   /**< Set program row data size 128 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_256BIT  = (0x05UL),   /**< Set program row data size 256 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_512BIT  = (0x06UL),   /**< Set program row data size 512 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_1024BIT = (0x07UL),   /**< Set program row data size 1024 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_2048BIT = (0x08UL),   /**< Set program row data size 2048 bit */
    CY_FLASH_PROGRAMROW_DATA_SIZE_4096BIT = (0x09UL)    /**< Set program row data size 4096 bit */
} cy_en_flash_programrow_datasize_t;

/** Flash Program row function execution type configuration */
typedef enum
{
    CY_FLASH_PROGRAMROW_NON_BLOCKING = (0x00UL),   /**< Set program row API in non blocking mode */
    CY_FLASH_PROGRAMROW_BLOCKING     = (0x01UL)    /**< Set program row API in blocking mode */
} cy_en_flash_programrow_blocking_t;

