zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/** Flash blank check on Program row configuration */
typedef enum
{
    CY_FLASH_PROGRAMROW_BLANK_CHECK      =  (0x00UL),    /**< Performs blank check on Program Row */
    CY_FLASH_PROGRAMROW_SKIP_BLANK_CHECK =  (0x01UL)     /**< Does not perform blank check on Program Row */
} cy_en_flash_programrow_skipblankcheck_t;

/** Flash Program row data location configuration */
typedef enum
{
    CY_FLASH_PROGRAMROW_DATA_LOCATION_SRAM       = (0x01UL)  /**< Program Row data location is sram */
} cy_en_flash_programrow_location_t;

/** Flash Program row interrupt mask configuration */
typedef enum
{
    CY_FLASH_PROGRAMROW_NOT_SET_INTR_MASK = (0x00UL),  /**< Program Row API interrupt is not set */
    CY_FLASH_PROGRAMROW_SET_INTR_MASK     = (0x01UL)   /**< Program Row API interrupt is set */
} cy_en_flash_programrow_intrmask_t;

/** Flash Erase sector function execution type configuration */
typedef enum
{
    CY_FLASH_ERASESECTOR_NON_BLOCKING      = (0x00UL), /**< Erase sector API executed in non blocking mode */
    CY_FLASH_ERASESECTOR_BLOCKING          = (0x01UL)  /**< Erase sector API executed in blocking mode */
} cy_en_flash_erasesector_blocking_t;

/** Flash Erase sector interrupt mask configuration */
typedef enum
{
    CY_FLASH_ERASESECTOR_NOT_SET_INTR_MASK = (0x00UL), /**< Erase sector API interrupt is not set */
    CY_FLASH_ERASESECTOR_SET_INTR_MASK     = (0x01UL)  /**< Erase sector API interrupt is set */
} cy_en_flash_erasesector_intrmask_t;

/** Flash checksum bank configuration */
typedef enum
{
    CY_FLASH_CHECKSUM_BANK0     = (0x00UL), /**< Checksum calculated for Bank0 */
    CY_FLASH_CHECKSUM_BANK1     = (0x01UL)  /**< Checksum calculated for Bank1 */
} cy_en_flash_checksum_bank_t;

/** Flash checksum page configuration */
typedef enum
{
    CY_FLASH_CHECKSUM_PAGE     = (0x00UL), /**< Checksum calculated for that page */
    CY_FLASH_CHECKSUM_WHOLE    = (0x01UL)  /**< Checksum calculated for whole region */
} cy_en_flash_checksum_scope_t;

/** Flash checksum region configuration */
typedef enum
{
    CY_FLASH_CHECKSUM_MAIN        = (0x00UL), /**< Checksum calculated for Main flash region */
    CY_FLASH_CHECKSUM_WORK        = (0x01UL), /**< Checksum calculated for Work flash region */
    CY_FLASH_CHECKSUM_SUPERVISORY = (0x02UL)  /**< Checksum calculated for Supervisory flash region */
} cy_en_flash_checksum_region_t;

/** Flash compute hash configuration */
typedef enum
{
    CY_FLASH_COMPUTEHASH_BASIC  = (0x00UL), /**< Compute Basic hash */
    CY_FLASH_COMPUTEHASH_CRC8   = (0x01UL)  /**< Compute CRC8 hash */
} cy_en_flash_computehash_type_t;

/** Flash Erase resume interrupt mask configuration */
typedef enum
{
    CY_FLASH_ERASERESUME_NOT_SET_INTR_MASK  = (0x00UL), /**< Erase resume API interrupt is not set */
    CY_FLASH_ERASERESUME_SET_INTR_MASK      = (0x01UL)  /**< Erase resume API interrupt is set */
} cy_en_flash_eraseresume_setintr_t;

/** Flash Erase resume function execution type configuration */
typedef enum
{
    CY_FLASH_ERASERESUME_NON_BLOCKING  = (0x00UL), /**< Set erase resume API in non blocking mode */
    CY_FLASH_ERASERESUME_BLOCKING      = (0x01UL)  /**< Set erase resume API in blocking mode */
} cy_en_flash_eraseresume_blocking_t;

/** Flash driver function execution type configuration */
typedef enum
{
    CY_FLASH_DRIVER_NON_BLOCKING  = (0x00UL),    /**< Set SROM API in non blocking mode */
    CY_FLASH_DRIVER_BLOCKING      = (0x01UL)     /**< Set SROM API in blocking mode */
} cy_en_flash_driver_blocking_t;

/** \} group_flash_enumerated_types */
#endif // (defined(CY_IP_MXFLASHC_VERSION_ECT))

/***************************************
* Data Structure definitions
***************************************/
#if (defined(CY_IP_MXFLASHC_VERSION_ECT)) || defined(CY_DOXYGEN)

/**
* \addtogroup group_flash_srom_config_structure
* \{
*/
/** Flash program row configuration structure */
typedef struct
{
    const uint32_t*                         destAddr; /**< Destination address of flash  */
    const uint32_t*                         dataAddr; /**< pointer to 32byte aligned source data to be written to the flash */
    cy_en_flash_programrow_blocking_t       blocking; /**< blocking or non blocking mode. \ref cy_en_flash_programrow_blocking_t */
    cy_en_flash_programrow_skipblankcheck_t skipBC;   /**< blank check operation \ref cy_en_flash_programrow_skipblankcheck_t */
    cy_en_flash_programrow_datasize_t       dataSize; /**< size of the data to be written. \ref cy_en_flash_programrow_datasize_t */
    cy_en_flash_programrow_location_t       dataLoc;  /**< data location for the operation \ref cy_en_flash_programrow_location_t */
    cy_en_flash_programrow_intrmask_t       intrMask; /**< interrupt mask to be set. \ref cy_en_flash_programrow_intrmask_t */
}cy_stc_flash_programrow_config_t;

/** Flash erase row configuration structure */
typedef struct
{
    const uint32_t*                    sectorAddr;  /**< Sector address to be erased */
    cy_en_flash_erasesector_blocking_t blocking;    /**< blocking or non blocking mode \ref cy_en_flash_erasesector_blocking_t */
    cy_en_flash_erasesector_intrmask_t intrMask;    /**< interrupt mask to be set. \ref cy_en_flash_erasesector_intrmask_t */
}cy_stc_flash_erasesector_config_t;

/** Flash checksum configuration structure */
typedef struct
{
    uint8_t                       rowId;  /**< row id for checksum */
    cy_en_flash_checksum_bank_t   bank;   /**< Checksum calculated for Bank0 or Bank1 \ref cy_en_flash_checksum_bank_t */
    cy_en_flash_checksum_scope_t  whole;  /**< Checksum calculated for whole region or page \ref cy_en_flash_checksum_scope_t */
    cy_en_flash_checksum_region_t region; /**< Specifies the configuration of flash operation \ref cy_en_flash_checksum_region_t */
} cy_stc_flash_checksum_config_t;

/** Flash compute hash configuration structure */
typedef struct
{
    const uint32_t*                startAddr; /**< Address for computing hash */
    uint32_t                       numOfByte; /**< Number of Bytes for computing hash */
    cy_en_flash_computehash_type_t type;      /**< Compute CRC8 hash or basic hash. /ref cy_en_flash_computehash_type_t*/
} cy_stc_flash_computehash_config_t;

