zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/** Flash erase resume configuration structure */
typedef struct
{
    cy_en_flash_eraseresume_setintr_t  intrMask; /**< Interrupt mask for erase resume operation \ref cy_en_flash_eraseresume_setintr_t */
    cy_en_flash_eraseresume_blocking_t blocking; /**< Blocking or non blocking mode. \ref cy_en_flash_eraseresume_blocking_t */
} cy_stc_flash_eraseresume_config_t;

/** Flash blank check configuration structure */
typedef struct
{
    const uint32_t* addrToBeChecked;         /**< Address for which blank check to be performed. */
    uint32_t        numOfWordsToBeChecked;   /**< No of words to be checked. */
} cy_stc_flash_blankcheck_config_t;

/** \} group_flash_srom_config_structure */

#endif // (defined(CY_IP_MXFLASHC_VERSION_ECT))


/***************************************
* Function Prototypes
***************************************/
#if (defined(CY_IP_MXFLASHC_VERSION_ECT)) || defined(CY_DOXYGEN)


/**
* \addtogroup group_flash_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_Flash_ResolveBase
****************************************************************************//**
*
* \brief Determines which flash controller (FLASHC or FLASHC1) owns the given
* address by checking all work-flash and main-flash address ranges.
*
* On single-controller devices (no FLASHC1), only FLASHC ranges are checked.
* On dual-controller devices, FLASHC1 ranges are also checked when the address
* does not fall within FLASHC ranges.
*
* \note This function is applicable for CAT1C devices.
*
* \param addr The flash address to resolve.
*
* \param base Output pointer. On success, set to the FLASHC_Type pointer of the
*        flash controller that owns the given address.
*
* \return \ref CY_FLASH_DRV_SUCCESS if the address is in bounds and *base is set.
*         \ref CY_FLASH_DRV_INVALID_INPUT_PARAMETERS if the address is out of
*         all flash ranges.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_ResolveBase(uint32_t addr, FLASHC_Type **base);


/*******************************************************************************
* Function Name: Cy_Flashc_MainWriteEnable_Base
****************************************************************************//**
*
* \brief Enable writing to main flash.
* Enables writing to main flash.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainWriteEnable_Base(FLASHC_Type *base);


/*******************************************************************************
* Function Name: Cy_Flashc_MainWriteDisable_Base
****************************************************************************//**
*
* \brief Disable writing to main flash
* Disables writing to main flash.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainWriteDisable_Base(FLASHC_Type *base);


/*******************************************************************************
* Function Name: Cy_Flashc_WorkWriteEnable_Base
****************************************************************************//**
*
* \brief Enable writing work flash
* Work Flash embedded operations are enabled.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkWriteEnable_Base(FLASHC_Type *base);


/*******************************************************************************
* Function Name: Cy_Flashc_WorkWriteDisable_Base
****************************************************************************//**
*
* \brief Disable writing work flash
* Work Flash embedded operations are blocked
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkWriteDisable_Base(FLASHC_Type *base);


/*******************************************************************************
* Function Name: Cy_Flashc_WorkECCEnable_Base
****************************************************************************//**
*
* \brief Enables ECC for work flash
* ECC checking/reporting on FLASH work interface is enabled.
* Correctable or non-correctable faults are reported by enabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkECCEnable_Base(FLASHC_Type *base);

/*******************************************************************************
* Function Name: Cy_Flashc_WorkECCDisable_Base
****************************************************************************//**
*
* \brief Disables ECC for work flash
* ECC checking/reporting on FLASH work interface is disabled.
* No correctable or non-correctable faults are reported by disabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkECCDisable_Base(FLASHC_Type *base);


/*******************************************************************************
* Function Name: Cy_Flashc_MainECCEnable_Base
****************************************************************************//**
*
* \brief Enables ECC for main flash
* ECC checking/reporting on FLASH main interface is enabled.
* Correctable or non-correctable faults are reported by enabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainECCEnable_Base(FLASHC_Type *base);

