zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/*******************************************************************************
* Function Name: Cy_Flashc_MainECCDisable_Base
****************************************************************************//**
*
* \brief Disables ECC for main flash.
* ECC checking/reporting on FLASH main interface is disabled.
* No correctable or non-correctable faults are reported by disabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainECCDisable_Base(FLASHC_Type *base);

/*******************************************************************************
* Function Name: Cy_Flash_Program_WorkFlash
****************************************************************************//**
*
* This function writes an array data to work flash. Reports success or
* or a reason for failure. User should only pass work flash address else it will return an error.
* This function executes in blocking mode only.
*
* The flash controller is resolved internally from config->destAddr.
*
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash. User firmware should not enter the hibernate
* mode until flash Write is complete. The Flash operation is allowed in Sleep and
* Deep-sleep modes. During the Flash operation, the device should not be reset,
* including the XRES pin, a software reset, and watchdog reset sources. Also,
* low-voltage detect circuits should be configured to generate an interrupt instead
* of a reset. Otherwise, portions of flash may undergo unexpected changes.
* \note  A Read while Write violation occurs when a flash Read operation is initiated
* in the same or neighboring flash sector where the flash Write, Erase, or
* Program operation is working. This violation may cause a HardFault exception.
* To avoid the Read while Write violation,
* use Cy_Flash_IsOperationComplete() to ensure flash operation is complete.
*
* \note This function is applicable for CAT1C devices.
*
* \note User needs to make sure that the data pointer passed to this function points to 32 byte aligned data.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_programrow_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flash_Program_WorkFlash
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Program_WorkFlash(const cy_stc_flash_programrow_config_t* config);

/*******************************************************************************
* Function Name: Cy_Flash_Program
****************************************************************************//**
*
* This function writes an array of data to flash. Reports success or
* or a reason for failure.
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash. User firmware should not enter the hibernate
* mode until flash Write is complete. The Flash operation is allowed in Sleep and
* Deep-sleep modes. During the Flash operation, the device should not be reset,
* including the XRES pin, a software reset, and watchdog reset sources. Also,
* low-voltage detect circuits should be configured to generate an interrupt instead
* of a reset. Otherwise, portions of flash may undergo unexpected changes.
* \note  A Read while Write violation occurs when a flash Read operation is initiated
* in the same or neighboring flash sector where the flash Write, Erase, or
* Program operation is working. This violation may cause a HardFault exception.
* To avoid the Read while Write violation,
* use Cy_Flash_IsOperationComplete() to ensure flash operation is complete.
*
* \note This function is applicable for CAT1C devices.
*
* \note User needs to make sure that the data pointer passed to this function points to 32 byte aligned data.
*
* The flash controller is resolved internally from config->destAddr.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_programrow_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \param block specifies if the function to execute in blocking or non blocking mode.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
* returns CY_FLASH_DRV_OPERATION_STARTED if operation starts with out error in non blocking mode.
* returns CY_FLASH_DRV_SUCCESS in blocking mode.
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flash_Program
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Program(const cy_stc_flash_programrow_config_t* config, cy_en_flash_driver_blocking_t block);

/*******************************************************************************
* Function Name: Cy_Flash_Checksum
****************************************************************************//**
*
* Returns a checksum value of the specified flash row. supports only blocking
* mode for now.
*
* \note This function is applicable for CAT1C devices.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_checksum_config_t
* in \ref cy_stc_flash_checksum_config_t macro.
*
* \param checksumPtr The pointer to the address where checksum is to be stored
*
* \return Returns the status of the Flash operation.
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flash_Checksum
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Checksum(const cy_stc_flash_checksum_config_t *config, uint32_t* checksumPtr);

/*******************************************************************************
* Function Name: Cy_Flash_EraseSuspend_Base
****************************************************************************//**
*
* This function suspends an ongoing erase operation. User should not read from a
* sector which is suspended from an erase operation. Cy_Flash_ProgramRow function
* will return error if invoked on suspended sector.
* This function cannot be called on SFLASH. Reports success
* or a reason for failure. Does not return until the Erase operation is complete.
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash.
* This function supports only blocking mode for now.
*
* \note This function is applicable for CAT1C devices.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseSuspend_Base(FLASHC_Type *base);

