zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/*******************************************************************************
* Function Name: Cy_Flash_EraseResume
****************************************************************************//**
*
* This function calls to resume a suspended erase operation.
* Reports success or a reason for failure.
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash.
* \note  A Read while Write violation occurs when a flash Read operation is initiated
* in the same or neighboring flash sector where the flash Write, Erase, or
* Program operation is working. This violation may cause a HardFault exception.
* To avoid the Read while Write violation,
* use Cy_Flash_IsOperationComplete() to ensure flash operation is complete.
*
* \note This function is applicable for CAT1C devices.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_eraseresume_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseResume(const cy_stc_flash_eraseresume_config_t *config);

/*******************************************************************************
* Function Name: Cy_Flash_BlankCheck
****************************************************************************//**
*
* This function performs blank check on the addressed work FLASH.
* Reports success or a reason for failure.
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash.
*
* The flash controller is resolved internally from config->addrToBeChecked.
*
* \note This function is applicable for CAT1C devices.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_blankcheck_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \param block specifies if the function to execute in blocking or non blocking mode.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
* returns CY_FLASH_DRV_OPERATION_STARTED if operation starts with out error in non blocking mode.
* returns CY_FLASH_DRV_SUCCESS in blocking mode.
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Flashc_test_code
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_BlankCheck(const cy_stc_flash_blankcheck_config_t *config, cy_en_flash_driver_blocking_t block);

/*******************************************************************************
* Function Name: Cy_Flash_OperationStatus_Base
****************************************************************************//**
*
* Checks the status of the Flash Operation, and returns it.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return Driver status.
* returns CY_FLASH_DRV_OPERATION_STARTED if operation in non blocking mode is not complete.
* returns CY_FLASH_DRV_SUCCESS if the operation is complete.
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Flashc_test_code
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_OperationStatus_Base(FLASHC_Type *base);

/*******************************************************************************
* Function Name: Cy_Flashc_InjectECC
****************************************************************************//**
*
* This function enables ECC injection and sets the address where a parity will be injected
* and the parity value.
* Reports success or a reason for failure.
*
* The flash controller is resolved internally from the address parameter.
*
* \note This function is applicable for CAT1C devices.
*
* \param region An indicator which region (Code/Work/Cache) ECC parity will be injected to.
* This parameter is defined by the cy_en_region_t
* in \ref group_flash_macros macro.
*
* \param address The address where ECC parity will be injected.
*
* \param parity The parity value which will be injected.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flashc_InjectECC(cy_en_region_t region, uint32_t address, uint8_t parity);

/*******************************************************************************
* Function Name: Cy_Flashc_InjectECC_Disable_Base
****************************************************************************//**
*
* This function disables ECC injection for the region specified.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \param region : ECC injection is disabled for this region (Code/Work/Cache).
* This parameter is defined by the cy_en_region_t
* in \ref group_flash_macros macro.
*
* \note This function is applicable for CAT1C devices.
*******************************************************************************/
void Cy_Flashc_InjectECC_Disable_Base(FLASHC_Type *base, cy_en_region_t region);

/*******************************************************************************
* Function Name: Cy_Flash_IsOperationComplete_Base
****************************************************************************//**
*
* Reports completion status of a non-blocking flash operation.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_IsOperationComplete_Base(FLASHC_Type *base);

/*******************************************************************************
* Function Name: Cy_Flash_StartWrite
****************************************************************************//**
*
* Starts row programming in non-blocking mode. The flash controller is resolved
* internally from rowAddr.
*
* \param rowAddr Address of the flash row.
* \param data Pointer to row data.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_StartWrite(uint32_t rowAddr, const uint32_t* data);

