zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/*******************************************************************************
* Function Name: Cy_Flash_StartEraseSector
****************************************************************************//**
*
* Starts sector erase in non-blocking mode. The flash controller is resolved
* internally from sectorAddr.
*
* \param sectorAddr Address of the flash sector.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_StartEraseSector(uint32_t sectorAddr);

/*******************************************************************************
* Function Name: Cy_Flash_ProgramRow
****************************************************************************//**
*
* Programs a flash row in blocking mode. The flash controller is resolved
* internally from rowAddr.
*
* \param rowAddr Address of the flash row.
* \param data Pointer to row data.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_ProgramRow(uint32_t rowAddr, const uint32_t* data);

/*******************************************************************************
* Function Name: Cy_Flash_EraseSector
****************************************************************************//**
*
* Erases a flash sector in blocking mode. The flash controller is resolved
* internally from sectorAddr.
*
* \param sectorAddr Address of the flash sector.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseSector(uint32_t sectorAddr);

/*******************************************************************************
* Function Name: Cy_Flash_CalculateHash
****************************************************************************//**
*
* Calculates a hash for the specified flash range. The flash controller is
* resolved internally from the data pointer.
*
* \param data Start address for hash computation.
* \param numberOfBytes Number of bytes to include in hash computation.
* \param hashPtr Pointer to the output hash value.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_CalculateHash(const uint32_t* data, uint32_t numberOfBytes, uint32_t* hashPtr);

/*******************************************************************************
* Function Name: Cy_Flash_RowChecksum
****************************************************************************//**
*
* Calculates checksum for the specified flash row. The flash controller is
* resolved internally from rowAddr.
*
* \param rowAddr Address of the flash row.
* \param checksumPtr Pointer to the output checksum value.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_RowChecksum(uint32_t rowAddr, uint32_t* checksumPtr);

/*******************************************************************************
* Function Name: Cy_Flashc_SetWorkBankMode_Base
****************************************************************************//**
*
* Sets work flash bank mode for the selected flash controller.
*
* \param base Pointer to the selected FLASH controller instance.
* \param mode Desired bank mode.
*
*******************************************************************************/
void Cy_Flashc_SetWorkBankMode_Base(FLASHC_Type *base, cy_en_bankmode_t mode);

/*******************************************************************************
* Function Name: Cy_Flashc_GetWorkBankMode_Base
****************************************************************************//**
*
* Gets work flash bank mode for the selected flash controller.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return Current bank mode.
*
*******************************************************************************/
cy_en_bankmode_t Cy_Flashc_GetWorkBankMode_Base(FLASHC_Type *base);

/*******************************************************************************
* Function Name: Cy_Flashc_SetMainBankMode_Base
****************************************************************************//**
*
* Sets main flash bank mode for the selected flash controller.
*
* \param base Pointer to the selected FLASH controller instance.
* \param mode Desired bank mode.
*
*******************************************************************************/
void Cy_Flashc_SetMainBankMode_Base(FLASHC_Type *base, cy_en_bankmode_t mode);

/*******************************************************************************
* Function Name: Cy_Flashc_GetMainBankMode_Base
****************************************************************************//**
*
* Gets main flash bank mode for the selected flash controller.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return Current bank mode.
*
*******************************************************************************/
cy_en_bankmode_t Cy_Flashc_GetMainBankMode_Base(FLASHC_Type *base);

/*******************************************************************************
* Function Name: Cy_Flashc_SetMain_Flash_Mapping_Base
****************************************************************************//**
*
* Sets main flash mapping for the selected flash controller.
*
* \param base Pointer to the selected FLASH controller instance.
* \param mapping Mapping selection.
*
*******************************************************************************/
void Cy_Flashc_SetMain_Flash_Mapping_Base(FLASHC_Type *base, cy_en_maptype_t  mapping);

/*******************************************************************************
* Function Name: Cy_Flashc_SetWork_Flash_Mapping_Base
****************************************************************************//**
*
* Sets work flash mapping for the selected flash controller.
*
* \param base Pointer to the selected FLASH controller instance.
* \param mapping Mapping selection.
*
*******************************************************************************/
void Cy_Flashc_SetWork_Flash_Mapping_Base(FLASHC_Type *base, cy_en_maptype_t mapping);

/** \} group_flash_functions */

#endif

#if ((!defined(CY_IP_MXFLASHC_VERSION_ECT)) || defined(CY_DOXYGEN))

/**
* \addtogroup group_flash_functions
* \{
*/

