zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/*******************************************************************************
* Function Name: Cy_Flash_GetExternalStatus
****************************************************************************//**
*
* This function handles the case where a module such as security image captures
* a system call from this driver and reports its own status or error code,
* for example protection violation. In that case, a function from this
* driver returns an unknown error (see cy_en_flashdrv_status_t). After receipt
* of an unknown error, the user may call this function to get the status
* of the capturing module.
*
* The user is responsible for parsing the content of the returned value
* and casting it to the appropriate enumeration.
* \note This function is applicable for CAT1A devices.
*
* \return Returns the status of the Flash operation code.
*******************************************************************************/
uint32_t Cy_Flash_GetExternalStatus(void);


#if ((!defined (CY_FLASH_RWW_DRV_SUPPORT_DISABLED) && !defined (CY_IP_MXS40FLASHC)) || defined(CY_DOXYGEN))
/*******************************************************************************
* Function Name: Cy_Flash_InitExt
****************************************************************************//**
*
* Initiates all needed prerequisites to support flash erase/write.
* Should be called from each core. Defines the address of the message structure.
*
* Requires a call to Cy_IPC_Sema_Init(), Cy_IPC_Pipe_Config() and
* Cy_IPC_Pipe_Init() functions before use.
*
* \note This function is applicable for CAT1A devices.
*
* This function is called in the Cy_Flash_Init() function - see the
* \ref Cy_Flash_Init usage considerations.
*
*******************************************************************************/
void Cy_Flash_InitExt(cy_stc_flash_notify_t *ipcWaitMessageAddr);
#endif /* !defined (CY_FLASH_RWW_DRV_SUPPORT_DISABLED) && !defined (CY_IP_MXS40FLASHC) */

/** \} group_flash_functions */

/** \cond INTERNAL */
#if (CY_CPU_CORTEX_M4)
void Cy_Flash_ResumeIrqHandler(void);
#endif

/*******************************************************************************
Backward compatibility macro. The following code is DEPRECATED and must
not be used in new projects
*******************************************************************************/
#define     CY_FLASH_NUMBER_ROWS             (CY_FLASH_SIZE / CY_FLASH_SIZEOF_ROW)
#define     Cy_Flash_StartErase              Cy_Flash_StartEraseRow

/** \endcond */


#endif //(defined(CY_IP_MXFLASHC_VERSION_ECT) || defined(CY_DOXYGEN))

/**
* \addtogroup group_flash_functions
* \{
*/
#if (((defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION >=2)) || defined (CY_IP_M7CPUSS)) && !defined(CY_IP_MXFLASHC_VERSION_ECT)) || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_Flashc_SetWorkBankMode
****************************************************************************//**
*
* \brief Sets bank mode for work flash
* \note This function is applicable for CAT1C devices.
*
*
* \param mode bank mode to be set
*
* \return none
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flashc_WorkBankMode
*******************************************************************************/
void Cy_Flashc_SetWorkBankMode(cy_en_bankmode_t mode);

/*******************************************************************************
* Function Name: Cy_Flashc_GetWorkBankMode
****************************************************************************//**
*
* \brief Gets current bank mode for work flash
* \note This function is applicable for CAT1C devices.
*
*
* \return Current bank mode
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flashc_WorkBankMode
*******************************************************************************/
cy_en_bankmode_t Cy_Flashc_GetWorkBankMode(void);

/*******************************************************************************
* Function Name: Cy_Flashc_SetMainBankMode
****************************************************************************//**
*
* \brief Sets bank mode for main flash
*
* \param mode bank mode to be set
*
* \return
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flashc_MainBankMode
*******************************************************************************/
void Cy_Flashc_SetMainBankMode(cy_en_bankmode_t mode);

/*******************************************************************************
* Function Name: Cy_Flashc_GetMainBankMode
****************************************************************************//**
*
* \brief Gets current bank mode for main flash
* \note This function is applicable for CAT1C devices.
*
*
* \return Current bank mode
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flashc_MainBankMode
*******************************************************************************/
cy_en_bankmode_t Cy_Flashc_GetMainBankMode(void);

/*******************************************************************************
* Function Name: Cy_Flashc_SetMain_Flash_Mapping
****************************************************************************//**
*
* \brief Sets mapping for main flash region. Applicable only in Dual Bank mode of Main flash region
*
* \param mapping mapping to be set
*
* \return none
*******************************************************************************/
void Cy_Flashc_SetMain_Flash_Mapping(cy_en_maptype_t  mapping);

/*******************************************************************************
* Function Name: Cy_Flashc_SetWork_Flash_Mapping
****************************************************************************//**
*
* \brief Sets mapping for work flash region. Applicable only in Dual Bank mode of Work flash region
*
* \param mapping mapping to be set
*
* \return none
*******************************************************************************/
void Cy_Flashc_SetWork_Flash_Mapping(cy_en_maptype_t mapping);


#endif /* (((defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION >=2)) || defined (CY_IP_M7CPUSS)) && !defined(CY_IP_MXFLASHC_VERSION_ECT)) || defined(CY_DOXYGEN) */

/** \} group_flash_functions */

/**
* \addtogroup group_flash_functions
* \{
*/

#if !defined(CY_IP_MXFLASHC_VERSION_ECT) || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_Flash_IsOperationComplete
****************************************************************************//**
*
* Reports a successful operation result, reason of failure or busy status
* ( \ref CY_FLASH_DRV_OPCODE_BUSY ).
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
* returns CY_FLASH_DRV_OPERATION_STARTED if operation in non blocking mode is not complete.
* returns CY_FLASH_DRV_SUCCESS if the operation is complete.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_IsOperationComplete(void);


