zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/*******************************************************************************
* Function Name: Cy_Flash_CalculateHash
****************************************************************************//**
*
* Returns a hash value of the specified region of flash.
*
* \param data Start the data address.
*
* \param numberOfBytes The hash value is calculated for the number of bytes after the
* start data address (0 - 1 byte, 1- 2 bytes etc).
*
* \param hashPtr The pointer to the address where hash is to be stored
*
* \return Returns the status of the Flash operation.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_CalculateHash(const uint32_t* data, uint32_t numberOfBytes, uint32_t* hashPtr);

/*******************************************************************************
* Function Name: Cy_Flash_RowChecksum
****************************************************************************//**
*
* Returns a checksum value of the specified flash row.
*
* \note Now Cy_Flash_RowChecksum() requires the row <b>address</b> (rowAddr)
*       as a parameter. In previous versions of the driver, this function used
*       the row <b>number</b> (rowNum) for this parameter.
*
* \param rowAddr The address of the flash row.
*
* \param checksumPtr The pointer to the address where checksum is to be stored
*
* \return Returns the status of the Flash operation.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_RowChecksum(uint32_t rowAddr, uint32_t* checksumPtr);
#endif /* !defined(CY_IP_MXFLASHC_VERSION_ECT) || defined(CY_DOXYGEN) */

/** \cond INTERNAL */
/* Backward-compatible aliases that use the default FLASHC controller. */
#if defined(CY_IP_MXFLASHC_VERSION_ECT)
#define Cy_Flashc_MainWriteEnable()                               Cy_Flashc_MainWriteEnable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_MainWriteDisable()                              Cy_Flashc_MainWriteDisable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_WorkWriteEnable()                               Cy_Flashc_WorkWriteEnable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_WorkWriteDisable()                              Cy_Flashc_WorkWriteDisable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_WorkECCEnable()                                 Cy_Flashc_WorkECCEnable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_WorkECCDisable()                                Cy_Flashc_WorkECCDisable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_MainECCEnable()                                 Cy_Flashc_MainECCEnable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_MainECCDisable()                                Cy_Flashc_MainECCDisable_Base((FLASHC_Type *)FLASHC)
#define Cy_Flash_EraseSuspend()                                   Cy_Flash_EraseSuspend_Base((FLASHC_Type *)FLASHC)
#define Cy_Flash_OperationStatus()                                Cy_Flash_OperationStatus_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_InjectECC_Disable(region)                       Cy_Flashc_InjectECC_Disable_Base((FLASHC_Type *)FLASHC, (region))
#define Cy_Flash_IsOperationComplete()                            Cy_Flash_IsOperationComplete_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_SetWorkBankMode(mode)                           Cy_Flashc_SetWorkBankMode_Base((FLASHC_Type *)FLASHC, (mode))
#define Cy_Flashc_GetWorkBankMode()                               Cy_Flashc_GetWorkBankMode_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_SetMainBankMode(mode)                           Cy_Flashc_SetMainBankMode_Base((FLASHC_Type *)FLASHC, (mode))
#define Cy_Flashc_GetMainBankMode()                               Cy_Flashc_GetMainBankMode_Base((FLASHC_Type *)FLASHC)
#define Cy_Flashc_SetMain_Flash_Mapping(mapping)                  Cy_Flashc_SetMain_Flash_Mapping_Base((FLASHC_Type *)FLASHC, (mapping))
#define Cy_Flashc_SetWork_Flash_Mapping(mapping)                  Cy_Flashc_SetWork_Flash_Mapping_Base((FLASHC_Type *)FLASHC, (mapping))
#endif
/** \endcond */

#if !defined(CY_IP_MXS40FLASHC)  || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_Flash_Init
****************************************************************************//**
*
* Initiates all needed prerequisites to support flash erase/write.
* Should be called from each core.
*
* Requires a call to Cy_IPC_Sema_Init(), Cy_IPC_Pipe_Config() and
* Cy_IPC_Pipe_Init() functions before use for CAT1A devices.
*
* This function is called in the SystemInit() function, for proper flash write
* and erase operations. If the default startup file is not used, or the function
* SystemInit() is not called in your project, ensure to perform the following steps
* before any flash or EmEEPROM write/erase operations:
* \snippet flash/snippet/main.c Flash Initialization
*
*******************************************************************************/
void Cy_Flash_Init(void);

#endif

#if defined(CY_IP_MXS40FLASHC)  || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_Flash_RegisterCallback
****************************************************************************//**
*
* Registers callback functions
*
* \param callBacks pointer to the callback functions structure \ref cy_stc_flash_callback_t
*
* \note Total 3 callbacks 1) Before starting the operation 2) When the operation is started 3) After completion of the operation.
*
*******************************************************************************/
void Cy_Flash_RegisterCallback(cy_stc_flash_callback_t *callBacks);

/*******************************************************************************
* Function Name: Cy_Flash_Init
****************************************************************************//**
*
* Initiates all needed prerequisites to support flash erase/write.
* Should be once before starting any flash operations.
*
* \param refresh_enable Enable or disable refresh feature
*
* \return Flash initialization status
*
* \note The return value is depending on the \p refresh_enable. \n
* When \p refresh_enable is false: \n
*   - CY_FLASH_DRV_SUCCESS if Init is complete otherwise will return error. \n
*   .
* When \p refresh_enable is true: \n
*   - CY_FLASH_DRV_SUCCESS if Init is completed. \n
*   - CY_FLASH_DRV_REFRESH_NOTHING if Init is completed and there are no any
*     flash rows to refresh otherwise will return an error.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Init(bool refresh_enable);

