zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash.h
/*******************************************************************************
* Function Name: Cy_Flash_Refresh
****************************************************************************//**
*
* This is a blocking call.
* Writes to the flash will cause slight degradation of the other cells in the flash.
* If the flash is written more than 100,000 times, errors may appear on flash reads.
* To prevent this, the refresh functions should be called before or after flash writes.
* The refresh functions are not available on CPUSS_FLASHC_SFLASH_SECNUM because it includes the SFLASH.
*
* \param flashAddr The address of the row that needs to be refreshed.
*
* \return Operation status: \n
*  * CY_FLASH_DRV_SUCCESS if Refresh is completed. \n
*  * CY_FLASH_DRV_REFRESH_NOTHING if there are no any flash rows to refresh otherwise will return an error.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Refresh(uint32_t flashAddr);

/*******************************************************************************
* Function Name: Cy_Flash_Refresh_Start
****************************************************************************//**
*
* This is a non-blocking call.
* Writes to the flash will cause slight degradation of the other cells in the flash.
* If the flash is written more than 100,000 times, errors may appear on flash reads.
* To prevent this, the refresh functions should be called before or after flash writes.
* The refresh functions are not available on CPUSS_FLASHC_SFLASH_SECNUM because it includes the SFLASH.
*
* \param flashAddr of the row that needs to be refreshed.
*
* \return success if refresh is started. Else will return error
*
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Refresh_Start(uint32_t flashAddr);

/*******************************************************************************
* Function Name: Cy_Flash_Is_Refresh_Required
****************************************************************************//**
* Checks if a flash refresh is needed for the sector.
* This is not allowed on sector which has SFLASH
*
* \returns TRUE, if a refresh is needed and FALSE, if a refresh is not needed.
*******************************************************************************/
bool Cy_Flash_Is_Refresh_Required(void);

/*******************************************************************************
* Function Name: Cy_Flashc_ECCEnable
****************************************************************************//**
*
* \brief Enables ECC for flash
* ECC checking/reporting on FLASH interface is enabled.
* Correctable or non-correctable faults are reported by enabling ECC.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_ECCEnable(void);

/*******************************************************************************
* Function Name: Cy_Flashc_ECCDisable
****************************************************************************//**
*
* \brief Disables ECC for flash
* ECC checking/reporting on FLASH interface is disabled.
* Correctable or non-correctable faults are not reported by disabling ECC.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_ECCDisable(void);

/*******************************************************************************
* Function Name: Cy_Flashc_INJ_ECCEnable
****************************************************************************//**
*
* \brief This function enable ECC error injection for FLASH interface
* And is applicable while ECC is enabled.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_INJ_ECCEnable(void);

/*******************************************************************************
* Function Name: Cy_Flashc_INJ_ECCDisable
****************************************************************************//**
*
* \brief This function disables ECC error injection for FLASH interface
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_INJ_ECCDisable(void);


/*******************************************************************************
* Function Name: Cy_Flashc_InjectECC
****************************************************************************//**
*
* \brief This function enables ECC injection and sets the address where a parity will be injected
* and the parity value.
* Reports success or a reason for failure.
*
* \param address The address where ECC parity will be injected.
*
* \param parity The parity value which will be injected.
*
* \returns none.
*
*******************************************************************************/
void Cy_Flashc_InjectECC(uint32_t address, uint8_t parity);

/*******************************************************************************
* Function Name: Cy_Flashc_Get_ECC_Error
****************************************************************************//**
*
* \brief This function when ECC injection is enabled and error is injected will return no of errors generated.
*
* \returns no of errors generated with ECC error injection \ref cy_en_flash_ecc_inject_errors_t.
*
*******************************************************************************/
cy_en_flash_ecc_inject_errors_t Cy_Flashc_Get_ECC_Error(void);

/*******************************************************************************
* Function Name: Cy_Flashc_Dual_Bank_Mode_Enable
****************************************************************************//**
*
* \brief Enables Dual bank Mode for flash
*
* \param mapping : Mapping for the main and work regions.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_Dual_Bank_Mode_Enable(cy_en_flash_dual_bank_mapping_t mapping);

/*******************************************************************************
* Function Name: Cy_Flashc_Dual_Bank_Mode_Disable
****************************************************************************//**
*
* \brief Disables Dual bank Mode for flash
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_Dual_Bank_Mode_Disable(void);

#endif /* !defined (CY_IP_MXS40FLASHC) */

/** \} group_flash_functions */

/** \cond INTERNAL */

/*******************************************************************************
Backward compatibility macro. The following code is DEPRECATED and must
not be used in new projects
*******************************************************************************/

#define     Cy_Flash_IsWriteComplete(...)    Cy_Flash_IsOperationComplete()
#define     Cy_Flash_IsProgramComplete(...)  Cy_Flash_IsOperationComplete()
#define     Cy_Flash_IsEraseComplete(...)    Cy_Flash_IsOperationComplete()
/** \endcond */


#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_M4CPUSS || CY_IP_M7CPUSS*/

#endif /* #if !defined (CY_FLASH_H) */

/** \} group_flash */

/* [] END OF FILE */
